export const replacementRules: Array<{msg : string, replaced: string} | string> = [
  { msg: '国家公务员录用考试《行测》题', replaced: '国考 ' },
  { msg: '公务员录用考试《行测》题', replaced: ' ' },
  { msg: '公务员录用考试《行测》', replaced: ' ' },
  '（地市级网友回忆版）',
  '（网友回忆版）',
  '（副省级网友回忆版）',
  '（行政执法卷网友回忆版）',
  '不完整试卷集锦',
  '（安徽/湖南/四川网友回忆版）',
  '（黑龙江/辽宁/云南/海南/贵州/广西/重庆/天津/山西/湖北/吉林/宁夏/新疆/陕西/安徽 ）',
  '（山东/浙江/江苏/辽宁/安徽/广西/四川）',
  { msg: '《职业能力倾向测验》', replaced: '' },
  { msg: '《职业能力倾向测验》笔试', replaced: '' },
  { msg: '《职业能力测试》笔试', replaced: '' },
  { msg: '《综合知识和能力素质》笔试', replaced: '' },
  { msg: '公务员考试《行测》题', replaced: '' },
  { msg: '《职业能力倾向测试》题', replaced: '' },
  { msg: '《职业能力倾向测验》题', replaced: '' },
  { msg: '网友回忆版', replaced: '' },
  { msg: '《行测》题', replaced: '' },
  { msg: '《职业能力测验》笔试精选题', replaced: '' },
  { msg: '综合知识和行政职业能力测验试卷', replaced: '' },
  { msg: '《综合基础知识》笔试', replaced: '' },
  { msg: '《职业能力测验》', replaced: '' },
  { msg: '《公共基础知识》笔试', replaced: '' },
  { msg: '《职业能力倾向测验》笔试精选题', replaced: '' },
  { msg: '《职业能力倾向测验》精选题', replaced: '' },
  { msg: '《行政职业能力测验》题', replaced: '' },
  { msg: '笔试精选题', replaced: '' },
  { msg: '《职业能力测试》题', replaced: '' },
  { msg: '《综合知识和能力素质》（管理岗客观题）', replaced: '' },
  { msg: '《��共基本能力测验》（管理岗）题精选', replaced: '' },
  { msg: '《综合基础知识》题', replaced: '' },
  { msg: '《公共基础知识》', replaced: '' },
  { msg: '《职业能力测验》笔试', replaced: '' },
  { msg: '《基本能力测试》', replaced: '' },
  { msg: '《思维能力测验》', replaced: '' },
  '《职业能力倾向测验》',
  '和《职业能力测试》', '《职业能力测试》',
  '精选题',
  '《行测》',
  '《行政职业能力测验》',
  '《职业能力测试真题》',
  '试题', '工作人员招聘考试', '公开招聘工作人员', '《综合能力素质》','笔试', '泰州市姜堰区高港区、兴化市、泰兴市', '考试', '公开招聘', '工作人员', '统考', '《行政职业能力测试》', '()', ' 试卷', '计划招募', '“', '”', '高校毕业生', '上午场', '·',
  '（安徽/湖北/贵州/云南/广西/宁夏/青海/甘肃/四川/内蒙古/陕西西安）', '招聘', '（精选）', ' 高校应届毕业生', '高校应届毕业生', '综合行政能力测验', '专业公务员招录', '优秀大学生到基层工作', '精选题', '网友回忆版', '（广西/黑龙江/内蒙古/云南/宁夏/贵州/海南/安徽/甘肃/江西/重庆/四川/陕西/青海/山西/新疆/辽宁网友回忆版）', '（内蒙古/宁���/新疆/湖北/湖南/云南/贵州/广西/四川/海南）', '（甘肃/湖北/陕西/云南/吉林长春/重庆市属）',
  '（黑龙江/辽宁/云南/海南/贵州/广西/重庆/天津/江西/山西/湖北/吉林/青海/宁夏/新疆/陕西/四川/安徽 ）', '（黑龙江/云南/甘肃/吉林/海南/四川/辽宁/湖北/新疆/重庆/安徽）', '（黑龙江/湖南/甘肃/吉林/四川/重庆/山西/安徽/新疆/内蒙古/湖北/辽宁/广西）', '（客观题部分满分60）', '《综合知识》', '西青、北辰、津南、宁河、武清、河东区',  '（广西/黑龙江/内蒙古/云南/宁夏/贵州/海南/安徽/甘肃/江西/重庆/四川/陕西/青海/山西/辽宁/新疆）', '（安徽/湖北/内蒙古/青海/甘肃/广西/宁夏/云南/四川）'

];

export function simplifySource(source: string): string {
  let simplified = source;
  for (const rule of replacementRules) {
    if (typeof rule === 'string') {
      simplified = simplified.replace(new RegExp(rule.replace(/[.*+?^${}()|[\]\\]/g, '\\$&'), 'g'), '');
    } else {
      simplified = simplified.replace(new RegExp(rule.msg.replace(/[.*+?^${}()|[\]\\]/g, '\\$&'), 'g'), rule.replaced);
    }
  }
  return simplified.trim();
}
